# Assignment #6 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2024</br>

Name: Louise Ramos
</br>
Date: March 7, 2024
<br>
<br>
**At this time in the semester:** <br>
--We have explored a dataset. <br>
--We have cleaned our dataset. <br>
--We created a Github account with a repository for this class and included a Metadata file about our data. <br>
--We introduced general SQL syntax, queries, and applications in R.<br>
<br>

Now we will start the process of uploading our dataset into a database. There are many different ways to upload your .csv data into a database (.db file). Databases can be created in many open source applications, MySQL workbench, and even some websites can load your .csv data into a database...for a small fee. Instead of using an application, we are going to first create our database for our dataset from scratch in R. On a much larger scale, data may be automatically uploaded to a database was once it is aquired.<br>

There are two R packages below we will use to create two separate databases for practice. One will be stored on our MySQL server using R package RMariaDB, and the other will be stored locally using R package SQLite. <br>
<br>
Follow the instructions below to complete the assignment. Answer any questions in markdown cell boxes. Be sure to comment all code.

### Creating our database from scratch to integrate with MySQL Workbench in R.<br>

In [1]:
!pip install mysql-connector-python
!pip install sqldf

Requirement already satisfied: mysql-connector-python in ./anaconda3/lib/python3.11/site-packages (8.3.0)
Requirement already satisfied: sqldf in ./anaconda3/lib/python3.11/site-packages (0.4.2)

### Creating a database from scratch in R using library(RMariaDB)<br>

https://cran.r-project.org/web/packages/RMariaDB/index.html

**BEFORE YOU BEGIN!**<br>
Is your MySQL Server running on your local machine?<br>
**Start the server** if it is not running already.

In [2]:
# Importing libraries
import mysql.connector
import sqlite3

In [3]:
# Setting the local user password
local_user_password = "1734680nN"

# Specifying the local port for the database connection
local_port = 3306  

# Defining the name of the database
db_name = "covid"

In [4]:
# Establishing a connection to the MySQL server
conn = mysql.connector.connect(user='root', password='1734680nN', host='localhost', port=3306)

# Creating a cursor object to interact with the database
cursor = conn.cursor()

In [5]:
# Executing a query to create a database if it doesn't exist
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {db_name}")

cursor.execute(f"USE {db_name}")

**STOP**<br><br>
Open MySQL Workbench.<br>
Under MySQL Connections, click Local Instance<br>
Click the Schemas tab<br>
**You should now see a new (empty) database that you created**<br>
If it does not show up right away, hit refresh (The circular arrows)

In [6]:
# Importing the pandas
import pandas as pd

# Reading the clean data 
df = pd.read_csv('Provisional_Covid_Deaths_Cleaned.csv')

In [7]:
# Showing the first few rows of the Data
df.head()

,jurisdiction_residence,group,subgroup1,subgroup2,covid_deaths,crude_covid_rate,aa_covid_rate,crude_covid_rate_ann,aa_covid_rate_ann,date
0,United States,Sex,Female,NaN,3.0,NaN,NaN,NaN,NaN,2020-01-01
1,United States,Sex,Male,NaN,3.0,NaN,NaN,NaN,NaN,2020-01-01
2,United States,Age,0-4 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01
3,United States,Age,12-17 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01
4,United States,Age,18-29 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01

In [8]:
# Getting the column names 
column_names = df.columns.tolist()

# Printing the column names
print(column_names)

['jurisdiction_residence', 'group', 'subgroup1', 'subgroup2', 'covid_deaths', 'crude_covid_rate', 'aa_covid_rate', 'crude_covid_rate_ann', 'aa_covid_rate_ann', 'date']

We can use a new SQL statement CREATE TABLE to create our first table in our new database.<br>
Everyone's data is different! Choose the SQL data types that fit YOUR data needs!<br>
SQL Data Types: https://www.w3schools.com/sql/sql_datatypes.asp

In [9]:
# query to create a table named covid_table with specific column and column types

first_table_query = """
CREATE TABLE covid_table (
    jurisdiction_residence VARCHAR(255),
    `group` VARCHAR(255),
    subgroup1 VARCHAR(255),
    subgroup2 VARCHAR(255),
    covid_deaths INT,
    crude_covid_rate FLOAT,
    aa_covid_rate FLOAT,
    crude_covid_rate_ann FLOAT,
    aa_covid_rate_ann FLOAT,
    date DATE
);
"""

# Execute the query
cursor.execute(first_table_query)

Define and list your SQL data types for your first table: <br><br>
**My SQL data types for my first table, table_name:**<br>

jurisdiction_residence VARCHAR(255),
`group` VARCHAR(255),
subgroup1 VARCHAR(255),
subgroup2 VARCHAR(255),
covid_deaths INT,
crude_covid_rate FLOAT,
aa_covid_rate FLOAT,
crude_covid_rate_ann FLOAT,
aa_covid_rate_ann FLOAT,
date DATE


All columns with strings were chose as VARCHAR to accommodate varying lengths of strings in the dataset. All numerical columns were chosen as FLOAT since these columns can vary between integers and decimals except for covid_deaths which is purely integers. Finally, the column containing the observation date data was made a DATE type so it would properly display as a date in the database. No primary key was chosen explicitly since all columns contain either some repetition or nulls.

Why did you choose these values to make up your first database table? What did you choose for your primary key and why?

In [10]:
# The table name 
table_name = "covid_table"

# Query that will show the column names from the table we created
query = f"SHOW COLUMNS FROM {table_name}"

# To retrieve the column names from the database
cursor.execute(query)
db_columns = [column[0] for column in cursor.fetchall()]

# Defining the common columns 
common_columns = list(set(df.columns) & set(db_columns))

In [11]:
#These are the ONLY columns that we will transfer into the table.
common_columns

['crude_covid_rate_ann',
 'subgroup1',
 'covid_deaths',
 'jurisdiction_residence',
 'subgroup2',
 'aa_covid_rate',
 'crude_covid_rate',
 'group',
 'aa_covid_rate_ann',
 'date']

In [12]:
#Creating a subset of the original 
df_subset = df[common_columns].copy()

In [13]:
# Import library create a database engine
from sqlalchemy import create_engine

# Specifying the name of the table
table_name = "covid_table"

# Creating a connection to the MySQL database
engine = create_engine('mysql+mysqlconnector://root:1734680nN@localhost:3306/covid')

try:
    # Writing the DataFrame subset
    df_subset.to_sql(name=table_name, con=engine, if_exists='append', index=False)
    print("Data transfer successful!")
except Exception as e:
    print(f"Error: {e}")

Data transfer successful!

Another option in creating tables could be to first create the table in R. We could select for certain columns and format them as.data.table() and then populate them into the SQL tables.

**STOP**<br><br>
In MySQL Workbench, you should see your new table that you have created and populated.<br>
You can run an SQL query directly in MySQL Workbench!<br>
You can also run a query below:

In [14]:
# Establish a connection to MySQL
conn = mysql.connector.connect(user='root', password='1734680nN', host='localhost', port=3306, database='covid')
cursor = conn.cursor()

# Query to get the sum of covid_deaths from only for the United States and females
query = "SELECT SUM(covid_deaths) AS total_deaths FROM covid_table WHERE jurisdiction_residence = 'United States' AND subgroup1 = 'Female';"

# Executing the query
cursor.execute(query)

# Getting the results
result = cursor.fetchone()

# Print the results
print("Total Deaths in the United States for Females:", result[0])

Total Deaths in the United States for Females: 527648

In [15]:
# The start and end dates for the query
start_date = '2020-01-01'
end_date = '2020-01-02'

subgroup1_value = 'Female'
jurisdiction_value = 'United States'

# Query with specified conditions
query = f"SELECT COUNT(*) FROM covid_table WHERE date BETWEEN '{start_date}' AND '{end_date}' AND subgroup1 = '{subgroup1_value}' AND jurisdiction_residence = '{jurisdiction_value}';"

# running the query
cursor.execute(query)

# Getting the result
result = cursor.fetchone()

# Showing the count
print("Number of records:", result[0])

Number of records: 1

**STOP**<br>
To create a new schema diagram for your new database (Even though it only has one table...it's good practice!)<br>
Open MySQL Workbench again<br>
Click Home<br>
Click the Models icon<br>
Click the > icon to the right of "Models"<br>
Choose “Create EER Model from Database” <br>
The Reverse Engineer Database Wizard starts and will walk you through your first database schema diagram.<br>
Save your model. <br>
You can now add relationships and or modify tables...but for this assignment, all we need is that first table. <br>

**Add a screen shot of your first schema diagram (The table) to your repository/Blackboard subission.**

In [16]:
# Close the connection to the database
conn.close()

Now what if we wanted to explore the number of each species observed within each separate body of water together? We'll begin JOINing tables in our next assignment.

### Creating our database from scratch locally and explore with MySQL in R.

### Creating a database from scratch in R using library(RSQLite)<br>

https://cran.r-project.org/web/packages/RSQLite/index.html

In [17]:
#BEFORE YOU BEGIN!
#Is your MySQL Server running on your local machine?
#Doesn't matter this time, please continue! :)

In [18]:
# Importing library
import sqlite3

In [19]:
# Defining the path for the SQLite database
db_path = "second_database_name.db"
# giving the table name 
table_name = "second_tablename"

In [20]:
# Connecting to the SQLite database
con = sqlite3.connect(db_path)

**STOP HERE**<br>
Before moving on, it is **important** to understand the difference of what we have just completed. Using RSQLite, we have created a database LOCALLY. Notice we did not specify a user, host, or password! We can find this database as a file on our machine. The .db file is created in the same location or working directory you are currently in. If you did not specify a working directory, the .db file is created where this .ipynb is located.

In [21]:
# Reading in the data from a CSV 
df2 = pd.read_csv('Provisional_Covid_Deaths_Cleaned.csv')
# Displaying the first few rows of the Data
df2.head()

,jurisdiction_residence,group,subgroup1,subgroup2,covid_deaths,crude_covid_rate,aa_covid_rate,crude_covid_rate_ann,aa_covid_rate_ann,date
0,United States,Sex,Female,NaN,3.0,NaN,NaN,NaN,NaN,2020-01-01
1,United States,Sex,Male,NaN,3.0,NaN,NaN,NaN,NaN,2020-01-01
2,United States,Age,0-4 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01
3,United States,Age,12-17 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01
4,United States,Age,18-29 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01

In [22]:
# Getting the column names present in both CSV and database table
common_columns = list(set(df2.columns) & set(db_columns))

# Subset the CSV data to include only the common columns
df2_subset = df2[common_columns].copy()

In [23]:
# Displaying the first few rows of the DataFrame to inspect the data
df.head()

,jurisdiction_residence,group,subgroup1,subgroup2,covid_deaths,crude_covid_rate,aa_covid_rate,crude_covid_rate_ann,aa_covid_rate_ann,date
0,United States,Sex,Female,NaN,3.0,NaN,NaN,NaN,NaN,2020-01-01
1,United States,Sex,Male,NaN,3.0,NaN,NaN,NaN,NaN,2020-01-01
2,United States,Age,0-4 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01
3,United States,Age,12-17 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01
4,United States,Age,18-29 years,NaN,0.0,0.0,NaN,0.0,NaN,2020-01-01

In [24]:
# Defining the path for the SQLite database file
db_path = "second_database_name.db"

# Establishing a connection to the SQLite database
conn = sqlite3.connect(db_path)

# Creating a cursor to interact with the database
cursor = conn.cursor()

# Defining the query to create the first table
first_table_query = """
CREATE TABLE IF NOT EXISTS table_name2 (
    jurisdiction_residence VARCHAR(255),
    `group` VARCHAR(255),
    subgroup1 VARCHAR(255),
    subgroup2 VARCHAR(255),
    covid_deaths INT,
    crude_covid_rate FLOAT,
    aa_covid_rate FLOAT,
    crude_covid_rate_ann FLOAT,
    aa_covid_rate_ann FLOAT,
    date DATE
);
"""

# Executing the query to create the table
cursor.execute(first_table_query)

In [25]:
# Reading in the file to populate our database
df2 = pd.read_csv('Provisional_Covid_Deaths_Cleaned.csv')

# Defining the table name
table_name = "table_name2"

# Making a connection to the SQLite database
engine = create_engine(f'sqlite:///{db_path}')

# writting the DataFrame to the table
df2.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

42768

Write a first query for our local database:

In [26]:
#importing libraries
import pandas as pd
import sqlite3

# Query to count the number of records
query = "SELECT COUNT(*) AS female_count FROM table_name2 WHERE subgroup1 = 'Female';"

result = pd.read_sql_query(query, con)

# Displaying the result
print(result)

   female_count
0           528

We have successfully queried from our database that we created locally using R library RSQLite.

Write a second query for our local database:

In [27]:
# Query to select distinct values from the group column
query = "SELECT DISTINCT `group` FROM table_name2;"

result = pd.read_sql_query(query, con)

# printing the results
print(result)

          group
0           Sex
1           Age
2          Race
3  Race and Age

Write a third query for our local database:

In [28]:
# Query to find the date with the highest number of COVID deaths in a single month

query = """
SELECT date, MAX(covid_deaths) AS highest_death_count
FROM table_name2
GROUP BY date
ORDER BY highest_death_count DESC
LIMIT 1;
"""
result = pd.read_sql_query(query, con)

# Displaying the highest death count and the  date
highest_death_count = result['highest_death_count'][0]
date_of_highest_death = result['date'][0]
print(f"The highest death count ({highest_death_count}) occurred on {date_of_highest_death}")

The highest death count (67990.0) occurred on 2020-12-01

In [29]:
#closing the connection
conn.close()